
#Область ПрограммныйИнтерфейс

// Изменяет параметры выбора поля Менеджер.
// 
// Параметры:
//  Форма - Форма - Изменяемая форма
//  ЭтоЗакупки - Булево
Процедура НастроитьПолеМенеджерНаФормеДокумента(Форма, ЭтоЗакупки = Ложь) Экспорт
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.RA_AdditionalFields_ItsSalesPurchasingOrganization", Истина);

	НовыеПараметры = Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйПараметр));

	Форма.Элементы.Менеджер.ПараметрыВыбора = НовыеПараметры;

	Если ЭтоЗакупки Тогда
		Форма.Элементы.Менеджер.Заголовок = ПредставлениеДляЗакупок();	
	Иначе
		Форма.Элементы.Менеджер.Заголовок = ПредставлениеДляПродаж();
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.Менеджер, "RA_AdditionalFields_ItsSalesPurchasingOrganization") Тогда
		Форма.Объект.Менеджер = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеДляПродаж()
	Возврат "Sales office";
КонецФункции

Функция ПредставлениеДляЗакупок()
	Возврат "Purchasing organization";
КонецФункции

#КонецОбласти