//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//#Область СлужебныеПРоцедурыИФункции 
//
//&ИзменениеИКонтроль("ТекстЗапросаВтТаблицаТовары")
//	Функция RA_AdditionalFieldsТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса, ДокументОбъект)
//
//	ИмяРегистра = "ВтТаблицаТовары";
//
//	СформироватьСуммыДокументаВВалютахУчета(Запрос, ТекстыЗапроса, Неопределено, ДокументОбъект);
//	УстановитьПараметрыЗапросаКоэффициентыВалют(Запрос);
//	ИнициализироватьКлючиАналитикиУчетаНоменклатуры(Запрос, ДокументОбъект);
//
//	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаАналитикУчетаПартий", ТекстыЗапроса) Тогда
//		ТекстЗапросаВтТаблицаАналитикУчетаПартий(Запрос, ТекстыЗапроса, ДокументОбъект);
//	КонецЕсли;
//
//	МассивЗапросов = Новый Массив;
//
//	ТекстЗапроса = "
//	|ВЫБРАТЬ
//	|	ЛОЖЬ КАК ВключениеНДСВСтоимость,
//	|	ТаблицаТовары.Ссылка                       		КАК Ссылка,
//	|	ТаблицаТовары.КодСтроки                    		КАК КодСтроки,
//	|	ТаблицаТовары.СтатьяРасходов               		КАК СтатьяРасходов,
//	|	ТаблицаТовары.АналитикаРасходов            		КАК АналитикаРасходов,
//	|	ТаблицаТовары.ЗаказПоставщику              		КАК ЗаказПоставщику,
//	|	ТаблицаТовары.ОбъектРасчетов              		КАК ОбъектРасчетов,
//	|	ТаблицаТовары.Номенклатура                 		КАК Номенклатура,
//	|	ТаблицаТовары.НоменклатураТипНоменклатуры 		КАК ТипНоменклатуры,
//	|	ТаблицаТовары.Характеристика               		КАК Характеристика,
//	|	ТаблицаТовары.Серия                        		КАК Серия,
//	|	ТаблицаТовары.НазначениеТипНазначения			КАК НазначениеТипНазначения,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов         		КАК ВидЗапасовТипЗапасов,
//	|	ТаблицаТовары.НомерГТД                     		КАК НомерГТД,
//	|	ТаблицаТовары.ВидЗапасов                   		КАК ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|			И &ВернутьМногооборотнуюТару И НЕ &ТребуетсяЗалогЗаТару
//	|			ТОГДА ТаблицаТовары.ИдентификаторСтроки
//	|		КОГДА ДанныеДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
//	|			ТОГДА ТаблицаТовары.ИдентификаторСтроки
//	|		ИНАЧЕ ТаблицаТовары.ОбъектРасчетовУникальныйИдентификатор
//	|	КОНЕЦ КАК ИдентификаторФинЗаписи,
//	|	&НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
//	|
//	|	ТаблицаТовары.Количество                   		КАК Количество,
//	|	ВЫБОР
//	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
//	|				ИЛИ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
//	|			ТОГДА 0
//	|		ИНАЧЕ ТаблицаТовары.КоличествоПоРНПТ
//	|	КОНЕЦ КАК КоличествоПоРНПТ,
//	|	ЕСТЬNULL(ТаблицаТовары.НоменклатураПрослеживаемыйТовар, ЛОЖЬ) КАК ПрослеживаемыйТовар,
//	|	ТаблицаТовары.Цена                         		КАК Цена,
//	|	ТаблицаТовары.Склад                        		КАК Склад,
//	|	ТаблицаТовары.СкладЦеховаяКладовая        		КАК ЦеховаяКладовая,
//	|	ВЫБОР КОГДА ТаблицаТовары.СкладИспользоватьОрдернуюСхемуПриПоступлении
//	|			И &Период >= ТаблицаТовары.СкладДатаНачалаОрдернойСхемыПриПоступлении
//	|		ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ                                      		КАК ИспользоватьОрдернуюСхемуПриПоступлении,
//	|	ТаблицаТовары.Сумма                        		КАК Сумма,
//	|	ТаблицаТовары.СуммаНДС                     		КАК СуммаНДС,
//	|	ТаблицаТовары.СуммаСНДС                    		КАК СуммаСНДС,
//	|	ТаблицаТовары.ИдентификаторСтроки          		КАК ИдентификаторСтроки,
//	|	ТаблицаТовары.Назначение                   		КАК Назначение,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры   		КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики       		КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|
//	|	ТаблицаАналитикУчетаПартий.ВидЦенности			КАК ВидЦенности,
//	|	ТаблицаАналитикУчетаПартий.НалогообложениеНДС	КАК ВидДеятельностиНДС,
//	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|
//	|	ВЫБОР КОГДА ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|			И &ВернутьМногооборотнуюТару ТОГДА
//	|		ИСТИНА
//	|	ИНАЧЕ
//	|		ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоТараКВозврату,
//	|
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяУпр, 0) <> 0
//	|			ТОГДА Суммы.СуммаПриведеннаяУпр + Суммы.СуммаНДСУпр
//	|		ИНАЧЕ ЕСТЬNULL(Суммы.СуммаСНДСУпр, 0)
//	|	КОНЕЦ КАК СуммаСНДСУпр,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяУпр, 0) <> 0
//	|			ТОГДА Суммы.СуммаПриведеннаяУпр
//	|		ИНАЧЕ ЕСТЬNULL(Суммы.СуммаБезНДСУпр, 0)
//	|	КОНЕЦ КАК СуммаБезНДСУпр,
//	|	ЕСТЬNULL(Суммы.СуммаНДСУпр, 0)      КАК СуммаНДСУпр,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяРегл, 0) <> 0
//	|			ТОГДА Суммы.СуммаПриведеннаяРегл
//	|		ИНАЧЕ ЕСТЬNULL(Суммы.СуммаБезНДСРегл, 0)
//	|	КОНЕЦ КАК СуммаБезНДСРегл,
//	|	ЕСТЬNULL(Суммы.СуммаНДСРегл, 0)     КАК СуммаНДСРегл,
//	|	ЕСТЬNULL(Суммы.БазаНДСРегл, 0)      КАК БазаНДСРегл,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяРегл, 0) <> 0
//	|			ТОГДА Суммы.СуммаПриведеннаяРегл - Суммы.СуммаБезНДСРегл
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК ВременнаяРазница,
//	|
//	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
//	|		ТОГДА
//	|			ВЫБОР КОГДА ТаблицаАналитикУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
//	|				  И НЕ &ФормироватьНДСПредъявленныйПриВключенииВСтоимость
//	|				  И (НЕ ТаблицаТовары.СписатьНаРасходы
//	|					ИЛИ &НеотфактурованныеПоставкиУслугРабот)
//	|			ТОГДА
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяУпр, 0) <> 0
//	|						ТОГДА Суммы.СуммаПриведеннаяУпр + Суммы.СуммаНДСУпр
//	|					ИНАЧЕ ЕСТЬNULL(Суммы.СуммаСНДСУпр, 0)
//	|				КОНЕЦ
//	|			ИНАЧЕ
//	|				ВЫБОР
//	|					КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяУпр, 0) <> 0
//	|						ТОГДА Суммы.СуммаПриведеннаяУпр
//	|					ИНАЧЕ ЕСТЬNULL(Суммы.СуммаБезНДСУпр, 0)
//	|				КОНЕЦ
//	|			КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СтоимостьУпр,
//	|	ВЫБОР КОГДА &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
//	|		ТОГДА
//	|			ВЫБОР
//	|				КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяРегл, 0) <> 0
//	|					ТОГДА Суммы.СуммаПриведеннаяРегл
//	|				ИНАЧЕ ЕСТЬNULL(Суммы.СуммаБезНДСРегл, 0)
//	|			КОНЕЦ +
//	|			ВЫБОР КОГДА ТаблицаАналитикУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
//	|				  И НЕ &ФормироватьНДСПредъявленныйПриВключенииВСтоимость
//	|				  И (НЕ ТаблицаТовары.СписатьНаРасходы
//	|					ИЛИ &НеотфактурованныеПоставкиУслугРабот)
//	|			ТОГДА
//	|				ЕСТЬNULL(Суммы.СуммаНДСРегл, 0)
//	|			ИНАЧЕ
//	|				0
//	|			КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|
//	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведенная, 0) <> 0
//	|			ТОГДА Суммы.СуммаПриведенная + ТаблицаТовары.СуммаНДСВзаиморасчетов
//	|		ИНАЧЕ
//	|			ТаблицаТовары.СуммаВзаиморасчетов
//	|	КОНЕЦ КАК СуммаВзаиморасчетов,
//	|	ТаблицаТовары.СуммаНДСВзаиморасчетов КАК СуммаНДСВзаиморасчетов,
//	|	ВЫРАЗИТЬ(ТаблицаТовары.СуммаРучнойСкидки * &КоэффициентПересчетаВВалютуУПР КАК ЧИСЛО(15,1)) КАК СуммаСкидки,
//	|
//	|	ТаблицаТовары.Подразделение                  КАК Подразделение,
//	|	ТаблицаТовары.СписатьНаРасходы               КАК СписатьНаРасходы,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
//	|			ИЛИ (ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
//	|				И ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатурыНазначениеНаправлениеДеятельности,
//	|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
//	|			ТОГДА
//	|				ВЫБОР КОГДА &УчетЗатратПоНД ТОГДА
//	|					&НаправлениеДеятельности
//	|				ИНАЧЕ
//	|					НЕОПРЕДЕЛЕНО
//	|				КОНЕЦ
//	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатурыНазначениеНаправлениеДеятельности,
//	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
//	|	КОНЕЦ КАК НаправлениеДеятельности,
//	|	ЕСТЬNULL(АналитикаРасчетов.КлючАналитики, Неопределено) КАК АналитикаУчетаПоПартнерам,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатураТипНоменклатуры КАК АналитикаУчетаНоменклатурыНоменклатураТипНоменклатуры,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатурыНазначение КАК АналитикаУчетаНоменклатурыНазначение
//	|
//	|ПОМЕСТИТЬ ВтТаблицаТовары
//	|ИЗ
//	|	ДанныеДокументаТаблицаТовары КАК ТаблицаТовары
//	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК ДанныеДокумента
//	|		ПО ДанныеДокумента.Ссылка = ТаблицаТовары.Ссылка
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатура = АналитикаБезНазначения.Номенклатура
//	|		И ТаблицаТовары.АналитикаУчетаНоменклатурыХарактеристика = АналитикаБезНазначения.Характеристика
//	|		И ТаблицаТовары.АналитикаУчетаНоменклатурыСерия = АналитикаБезНазначения.Серия
//	|		И ТаблицаТовары.АналитикаУчетаНоменклатурыМестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаБезНазначения.Назначение
//	//++ НЕ УТ
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаБезНазначения.СтатьяКалькуляции
//	//-- НЕ УТ
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтСуммыДокументовВВалютахУчета КАК Суммы
//	|	ПО
//	|		ТаблицаТовары.Ссылка = Суммы.Ссылка
//	|		И ТаблицаТовары.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
//	|		И Суммы.СуммаБезНДСРегл <> 0
//	|		И Суммы.СуммаБезНДСУпр <> 0
//	|		И (ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) = Суммы.СуммаБезНДС
//	|		И ТаблицаТовары.СуммаНДС = Суммы.СуммаНДС
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
//	|	ПО ТаблицаАналитикУчетаПартий.НомерСтроки 		= ТаблицаТовары.НомерСтроки
//	|	 И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""Товары""
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаРасчетов
//	|	ПО
//	|		&Организация = АналитикаРасчетов.Организация
//	|		И &Контрагент = АналитикаРасчетов.Контрагент
//	|		И &Партнер = АналитикаРасчетов.Партнер
//	|		И &Договор = АналитикаРасчетов.Договор
//	|		И ТаблицаТовары.ОбъектРасчетовНаправлениеДеятельности = АналитикаРасчетов.НаправлениеДеятельности
//	|
//	|ГДЕ
//	|	ТаблицаТовары.Ссылка = &Ссылка";
//
//	МассивЗапросов.Добавить(ТекстЗапроса);
//
//	Если ДокументОбъект = Неопределено
//		ИЛИ (ДокументОбъект <> Неопределено И ДокументОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПриемНаКомиссию) Тогда
//
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	ИСТИНА КАК ВключениеНДСВСтоимость,
//	|	ТаблицаТовары.Ссылка                       		КАК Ссылка,
//	|	ТаблицаТовары.КодСтроки                    		КАК КодСтроки,
//	|	ТаблицаТовары.СтатьяРасходов               		КАК СтатьяРасходов,
//	|	ТаблицаТовары.АналитикаРасходов            		КАК АналитикаРасходов,
//	|	ТаблицаТовары.ЗаказПоставщику              		КАК ЗаказПоставщику,
//	|	ТаблицаТовары.ОбъектРасчетов              		КАК ОбъектРасчетов,
//	|	ТаблицаТовары.Номенклатура                 		КАК Номенклатура,
//	|	ТаблицаТовары.НоменклатураТипНоменклатуры 		КАК ТипНоменклатуры,
//	|	ТаблицаТовары.Характеристика               		КАК Характеристика,
//	|	ТаблицаТовары.Серия                        		КАК Серия,
//	|	ТаблицаТовары.НазначениеТипНазначения			КАК НазначениеТипНазначения,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов         		КАК ВидЗапасовТипЗапасов,
//	|	ТаблицаТовары.НомерГТД                     		КАК НомерГТД,
//	|	ТаблицаТовары.ВидЗапасов                   		КАК ВидЗапасов,
//	|	ТаблицаТовары.ИдентификаторСтроки          		КАК ИдентификаторФинЗаписи,
//	|	ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеНДСВСтоимость) КАК НастройкаХозяйственнойОперации,
//	|
//	|	0                                          		КАК Количество,
//	|	ВЫБОР
//	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
//	|				ИЛИ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
//	|			ТОГДА 0
//	|		ИНАЧЕ ТаблицаТовары.КоличествоПоРНПТ
//	|	КОНЕЦ КАК КоличествоПоРНПТ,
//	|	ЕСТЬNULL(ТаблицаТовары.НоменклатураПрослеживаемыйТовар, ЛОЖЬ) КАК ПрослеживаемыйТовар,
//	|	0                                        		КАК Цена,
//	|	ТаблицаТовары.Склад                        		КАК Склад,
//	|	ТаблицаТовары.СкладЦеховаяКладовая        		КАК ЦеховаяКладовая,
//	|	ВЫБОР КОГДА ТаблицаТовары.СкладИспользоватьОрдернуюСхемуПриПоступлении
//	|			И &Период >= ТаблицаТовары.СкладДатаНачалаОрдернойСхемыПриПоступлении
//	|		ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ                                      		КАК ИспользоватьОрдернуюСхемуПриПоступлении,
//	|	0                                         		КАК Сумма,
//	|	0                                       		КАК СуммаНДС,
//	|	0                                           	КАК СуммаСНДС,
//	|	ТаблицаТовары.ИдентификаторСтроки          		КАК ИдентификаторСтроки,
//	|	ТаблицаТовары.Назначение                   		КАК Назначение,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры   		КАК АналитикаУчетаНоменклатуры,
//	|	АналитикаБезНазначения.КлючАналитики       		КАК АналитикаУчетаНоменклатурыБезНазначения,
//	|
//	|	ТаблицаАналитикУчетаПартий.ВидЦенности			КАК ВидЦенности,
//	|	ТаблицаАналитикУчетаПартий.НалогообложениеНДС	КАК ВидДеятельностиНДС,
//	|	ТаблицаАналитикУчетаПартий.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
//	|
//	|	ВЫБОР КОГДА ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
//	|			И &ВернутьМногооборотнуюТару ТОГДА
//	|		ИСТИНА
//	|	ИНАЧЕ
//	|		ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоТараКВозврату,
//	|
//	|	0 КАК СуммаСНДСУпр,
//	|	0 КАК СуммаБезНДСУпр,
//	|	0 КАК СуммаНДСУпр,
//	|	0 КАК СуммаБезНДСРегл,
//	|	0 КАК СуммаНДСРегл,
//	|	0 КАК БазаНДСРегл,
//	|	0 КАК ВременнаяРазница,
//	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций
//	|		ТОГДА
//	|			ЕСТЬNULL(Суммы.СуммаНДСУпр, 0)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СтоимостьУпр,
//	|	ЕСТЬNULL(Суммы.СуммаНДСРегл, 0) КАК СтоимостьРегл,
//	|
//	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
//	|	0 КАК СуммаВзаиморасчетов,
//	|	0 КАК СуммаНДСВзаиморасчетов,
//	|	0 КАК СуммаСкидки,
//	|
//	|	ТаблицаТовары.Подразделение                  КАК Подразделение,
//	|	ТаблицаТовары.СписатьНаРасходы               КАК СписатьНаРасходы,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
//	|			ИЛИ (ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
//	|				И ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатурыНазначениеНаправлениеДеятельности,
//	|					ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
//	|			ТОГДА
//	|				ВЫБОР КОГДА &УчетЗатратПоНД ТОГДА
//	|					&НаправлениеДеятельности
//	|				ИНАЧЕ
//	|					НЕОПРЕДЕЛЕНО
//	|				КОНЕЦ
//	|		ИНАЧЕ ЕСТЬNULL(ТаблицаТовары.АналитикаУчетаНоменклатурыНазначениеНаправлениеДеятельности,
//	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
//	|	КОНЕЦ КАК НаправлениеДеятельности,
//	|	ЕСТЬNULL(АналитикаРасчетов.КлючАналитики, Неопределено) КАК АналитикаУчетаПоПартнерам,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатураТипНоменклатуры КАК АналитикаУчетаНоменклатурыНоменклатураТипНоменклатуры,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатурыНазначение КАК АналитикаУчетаНоменклатурыНазначение
//	|
//	|ИЗ
//	|	ДанныеДокументаТаблицаТовары КАК ТаблицаТовары
//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
//	|	ПО ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатура = АналитикаБезНазначения.Номенклатура
//	|		И ТаблицаТовары.АналитикаУчетаНоменклатурыХарактеристика = АналитикаБезНазначения.Характеристика
//	|		И ТаблицаТовары.АналитикаУчетаНоменклатурыСерия = АналитикаБезНазначения.Серия
//	|		И ТаблицаТовары.АналитикаУчетаНоменклатурыМестоХранения = АналитикаБезНазначения.МестоХранения
//	|		И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаБезНазначения.Назначение
//	//++ НЕ УТ
//	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаБезНазначения.СтатьяКалькуляции
//	//-- НЕ УТ
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		ВтСуммыДокументовВВалютахУчета КАК Суммы
//	|	ПО
//	|		ТаблицаТовары.Ссылка = Суммы.Ссылка
//	|		И ТаблицаТовары.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
//	|		И Суммы.СуммаБезНДСРегл <> 0
//	|		И Суммы.СуммаБезНДСУпр <> 0
//	|		И (ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) = Суммы.СуммаБезНДС
//	|		И ТаблицаТовары.СуммаНДС = Суммы.СуммаНДС
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтТаблицаАналитикУчетаПартий КАК ТаблицаАналитикУчетаПартий
//	|	ПО ТаблицаАналитикУчетаПартий.НомерСтроки 		= ТаблицаТовары.НомерСтроки
//	|	 И ТаблицаАналитикУчетаПартий.ИмяТабличнойЧасти = ""Товары""
//	|
//	|	ЛЕВОЕ СОЕДИНЕНИЕ
//	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаРасчетов
//	|	ПО
//	|		&Организация = АналитикаРасчетов.Организация
//	|		И &Контрагент = АналитикаРасчетов.Контрагент
//	|		И &Партнер = АналитикаРасчетов.Партнер
//	|		И &Договор = АналитикаРасчетов.Договор
//	|		И ТаблицаТовары.ОбъектРасчетовНаправлениеДеятельности = АналитикаРасчетов.НаправлениеДеятельности
//	|ГДЕ
//	|	ТаблицаТовары.Ссылка = &Ссылка
//	|	И ТаблицаАналитикУчетаПартий.НалогообложениеНДС В (&ТипыНалогообложенияНДСУчитываетсяВСтоимости)
//	|	И &ФормироватьНДСПредъявленныйПриВключенииВСтоимость
//	|	И (НЕ ТаблицаТовары.СписатьНаРасходы
//	|		ИЛИ &НеотфактурованныеПоставкиУслугРабот)
//	|	И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
//	|";
//
//	МассивЗапросов.Добавить(ТекстЗапроса);
//
//	КонецЕсли;
//
//	ТекстЗапроса = СтрСоединить(МассивЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
//
//	Если ДокументОбъект = Неопределено Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаТаблицаТовары", "Документ.ПриобретениеТоваровУслуг.Товары");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеДокументаШапка", "Документ.ПриобретениеТоваровУслуг");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.НоменклатураТипНоменклатуры", "ТаблицаТовары.Номенклатура.ТипНоменклатуры");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.ОбъектРасчетовУникальныйИдентификатор", "ТаблицаТовары.ОбъектРасчетов.УникальныйИдентификатор");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.НоменклатураПрослеживаемыйТовар", "ТаблицаТовары.Номенклатура.ПрослеживаемыйТовар");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.СкладИспользоватьОрдернуюСхемуПриПоступлении", "ТаблицаТовары.Склад.ИспользоватьОрдернуюСхемуПриПоступлении");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.СкладДатаНачалаОрдернойСхемыПриПоступлении", "ТаблицаТовары.Склад.ДатаНачалаОрдернойСхемыПриПоступлении");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыНазначениеНаправлениеДеятельности", "ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатураТипНоменклатуры", "ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыНоменклатура", "ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыХарактеристика", "ТаблицаТовары.АналитикаУчетаНоменклатуры.Характеристика");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыСерия", "ТаблицаТовары.АналитикаУчетаНоменклатуры.Серия");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыМестоХранения", "ТаблицаТовары.АналитикаУчетаНоменклатуры.МестоХранения");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.ОбъектРасчетовНаправлениеДеятельности", "ТаблицаТовары.ОбъектРасчетов.НаправлениеДеятельности");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.СкладЦеховаяКладовая", "ТаблицаТовары.Склад.ЦеховаяКладовая");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.АналитикаУчетаНоменклатурыНазначение", "ТаблицаТовары.АналитикаУчетаНоменклатуры.Назначение");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.НазначениеТипНазначения", "ТаблицаТовары.Назначение.ТипНазначения");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТовары.ВидЗапасовТипЗапасов", "ТаблицаТовары.ВидЗапасов.ТипЗапасов");
//	КонецЕсли;
//
//	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
//	Возврат ТекстЗапроса;
//
//КонецФункции
//
//&ИзменениеИКонтроль("ПолучитьДанныеДокумента")
//Процедура RA_AdditionalFieldsПолучитьДанныеДокумента(Запрос, ДокументСсылка)
//
//	СписокЗапросов = Новый Массив;
//
//	ТекстЗапросаДанныеДокументаШапка(СписокЗапросов);
//	ТекстЗапросаДанныеДокументаТаблицаТовары(СписокЗапросов);
//	ТекстЗапросаДанныеДокументаТаблицаВидыЗапасов(СписокЗапросов);
//	ТекстЗапросаДанныеДокументаТаблицаСерии(СписокЗапросов);
//	ТекстЗапросаДанныеДокументаТаблицаЭтапыГрафикаОплаты(СписокЗапросов);
//	ТекстЗапросаДанныеДокументаТаблицаРасшифровкаПлатежа(СписокЗапросов);
//	#Вставка
//	RA_AdditionalFields_ТекстЗапросаКостЦентрыПоАналитикамУчетаНоменклатуры(СписокЗапросов);
//	#КонецВставки
//
//	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
//
//	Запрос.Текст = ТекстЗапроса;
//	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
//	Запрос.Выполнить();
//
//КонецПроцедуры
//
//Процедура RA_AdditionalFields_ТекстЗапросаКостЦентрыПоАналитикамУчетаНоменклатуры(СписокЗапросов)
//	
//	ТекстЗапросаКостЦентрыПоАналитикамУчетаНоменклатуры = "
//		|ВЫБРАТЬ
//		|	ТаблицаТовары.Ссылка КАК Ссылка,
//		|	ТаблицаТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//		|	ТаблицаТовары.Назначение.RA_AdditionalFields_CostCentre КАК RA_AdditionalFields_CostCentre
//		|ПОМЕСТИТЬ ДанныеКостЦентрыПоАналитикамУчетаНоменклатуры
//		|ИЗ
//		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
//		|ГДЕ
//		|	ТаблицаТовары.Ссылка = &Ссылка
//		|	И НЕ ТаблицаТовары.Назначение.RA_AdditionalFields_CostCentre ЕСТЬ NULL
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТаблицаТовары.Ссылка,
//		|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
//		|	ТаблицаТовары.Назначение.RA_AdditionalFields_CostCentre
//		|";
//	
//	СписокЗапросов.Добавить(ТекстЗапросаКостЦентрыПоАналитикамУчетаНоменклатуры);
//	
//КонецПроцедуры
//
//#Область ТекстЗапросаТаблицаЗакупки
////@skip-check bsl-legacy-check-module-extension
////@skip-warning
//&ИзменениеИКонтроль("ТекстЗапросаТаблицаЗакупки")
//Функция RA_AdditionalFieldsТекстЗапросаТаблицаЗакупки(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект)
//
//	ИмяРегистра = "Закупки";
//
//	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
//		Возврат "";
//	КонецЕсли;
//
//	МассивЗапросов = Новый Массив;
//
//	ХозОперацииЗакупкаПоИмпорту    = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту);
//	ХозОперацииЗакупкаВСтранахЕАЭС = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС);
//	ХозОперацииЗакупкаУПоставщика  = ЗакупкиСервер.ХозяйственныеОперацииПоОсновной(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика);
//
//#Область ПоступлениеТоваров
//	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет
//		ИЛИ ХозОперацииЗакупкаПоИмпорту.Найти(ДокументОбъект.ХозяйственнаяОперация) <> Неопределено
//		ИЛИ ХозОперацииЗакупкаВСтранахЕАЭС.Найти(ДокументОбъект.ХозяйственнаяОперация) <> Неопределено
//		ИЛИ ХозОперацииЗакупкаУПоставщика.Найти(ДокументОбъект.ХозяйственнаяОперация) <> Неопределено Тогда
//
//	ПоступлениеТоваров =
//	"ВЫБРАТЬ
//	|	&Период КАК Период,
//	|	ВЫБОР КОГДА ТаблицаТовары.НазначениеТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала)
//	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемкаПодПринципала)
//	|		ИНАЧЕ &ХозяйственнаяОперация
//	|	КОНЕЦ КАК ХозяйственнаяОперация,
//	|	&Организация КАК Организация,
//	#Удаление
//	|	&Подразделение КАК Подразделение,
//	#КонецУдаления
//	#Вставка
//	| ЕСТЬNULL(ДанныеКостЦентрыПоАналитикамУчетаНоменклатуры.RA_AdditionalFields_CostCentre, &Подразделение) КАК Подразделение,
//	#КонецВставки
//	|	&Менеджер КАК Менеджер,
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельностиНоменклатуры,
//	|	ТаблицаТовары.Склад КАК Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов КАК ТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов КАК ВидЗапасов,
//	|	&Партнер КАК Партнер,
//	|	&Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА &УчетРасчетовСПоставщикамиПоНД ТОГДА
//	|			&НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
//	|	&Соглашение КАК Соглашение,
//	|	&Договор КАК Договор,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаТовары.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ КАК Заказ,
//	|	НЕОПРЕДЕЛЕНО КАК ПодотчетноеЛицо,
//	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Сумма,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СуммаБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл) КАК СуммаРегл,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл) КАК СуммаРеглБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаСкидки) КАК СуммаСкидки,
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Стоимость,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.ВидДеятельностиНДС В (
//	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
//	|			ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
//	|			ТОГДА СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл)
//	|		ИНАЧЕ СУММА(ТаблицаТовары.СуммаБезНДСРегл)
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	0 КАК ДопРасходы,
//	|	0 КАК ДопРасходыБезНДС,
//	|	&Валюта КАК ВалютаДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС) КАК СуммаВВалютеДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) КАК СуммаБезНДСВВалютеДокумента,
//	|	&ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов) КАК СуммаВВалютеВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов - ТаблицаТовары.СуммаНДСВзаиморасчетов) КАК СуммаБезНДСВВалютеВзаиморасчетов,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
//	|	ТаблицаТовары.ОбъектРасчетов КАК ИсточникГФУРасчетов
//	|ИЗ
//	|	ВтТаблицаТовары КАК ТаблицаТовары
//	#Вставка
//	| ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКостЦентрыПоАналитикамУчетаНоменклатуры КАК ДанныеКостЦентрыПоАналитикамУчетаНоменклатуры
//	| ПО ТаблицаТовары.АналитикаУчетаНоменклатуры = ДанныеКостЦентрыПоАналитикамУчетаНоменклатуры.АналитикаУчетаНоменклатуры
//	#КонецВставки
//	|ГДЕ
//	|	ТаблицаТовары.ТипНоменклатуры В (
//	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
//	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
//	|	И НЕ ТаблицаТовары.СписатьНаРасходы
//	|	И НЕ &ИспользуетсяДокументПоступлениеТоваров
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности,
//	|	ТаблицаТовары.Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов,
//	#Вставка
//	|	ЕСТЬNULL(ДанныеКостЦентрыПоАналитикамУчетаНоменклатуры.RA_AdditionalFields_CostCentre, &Подразделение),
//	#КонецВставки
//	|	ТаблицаТовары.ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаТовары.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаТовары.ОбъектРасчетов,
//	|	ТаблицаТовары.ВидДеятельностиНДС,
//	|	ВЫБОР КОГДА ТаблицаТовары.НазначениеТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала)
//	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемкаПодПринципала)
//	|		ИНАЧЕ &ХозяйственнаяОперация
//	|	КОНЕЦ";
//
//	МассивЗапросов.Добавить(ПоступлениеТоваров);
//
//	КонецЕсли;
//
//	Если ХозОперацииЗакупкаПоИмпорту.Найти(ДокументОбъект.ХозяйственнаяОперация) <> Неопределено
//		ИЛИ ХозОперацииЗакупкаВСтранахЕАЭС.Найти(ДокументОбъект.ХозяйственнаяОперация) <> Неопределено
//		ИЛИ ХозОперацииЗакупкаУПоставщика.Найти(ДокументОбъект.ХозяйственнаяОперация) <> Неопределено Тогда
//
//	ПоступлениеТоваров =
//	"ВЫБРАТЬ
//	|	&Период,
//	|	ВЫБОР КОГДА ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыНазначениеТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала)
//	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемкаПодПринципала)
//	|		ИНАЧЕ &ХозяйственнаяОперация
//	|	КОНЕЦ КАК ХозяйственнаяОперация,
//	|	&Организация,
//	|	&Подразделение,
//	|	&Менеджер,
//	|	ВЫБОР
//	|		КОГДА &ХозяйственнаяОперация В (
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))
//	|		ИЛИ &УчитыватьСебестоимостьТоваровПоНазначениям
//	|			ТОГДА ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
//	|		ИНАЧЕ
//	|			ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыБезНазначения
//	|	КОНЕЦ,
//	|	ТаблицаВидыЗапасов.НаправлениеДеятельности,
//	|	ТаблицаВидыЗапасов.Склад,
//	|	ТаблицаВидыЗапасов.ВидЗапасов.ТипЗапасов,
//	|	ТаблицаВидыЗапасов.ВидЗапасов,
//	|	&Партнер,
//	|	&Контрагент,
//	|	ВЫБОР
//	|		КОГДА &УчетРасчетовСПоставщикамиПоНД ТОГДА
//	|			&НаправлениеДеятельности
//	|	КОНЕЦ,
//	|	&Соглашение,
//	|	&Договор,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаВидыЗапасов.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ,
//	|	НЕОПРЕДЕЛЕНО,
//	|	СУММА(ТаблицаВидыЗапасов.Количество),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаСНДСУпр),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаБезНДСУпр),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаБезНДСРегл + ТаблицаВидыЗапасов.СуммаНДСРегл),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаБезНДСРегл),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаСкидки),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаСНДСУпр),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаБезНДСУпр),
//	|	ВЫБОР
//	|		КОГДА ТаблицаВидыЗапасов.ВидДеятельностиНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
//	|			ТОГДА СУММА(ТаблицаВидыЗапасов.СуммаБезНДСРегл + ТаблицаВидыЗапасов.СуммаНДСРегл)
//	|		ИНАЧЕ СУММА(ТаблицаВидыЗапасов.СуммаБезНДСРегл)
//	|	КОНЕЦ,
//	|	0,
//	|	0,
//	|	&Валюта,
//	|	СУММА(ТаблицаВидыЗапасов.СуммаСНДС),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаСНДС - ТаблицаВидыЗапасов.СуммаНДС),
//	|	&ВалютаВзаиморасчетов,
//	|	СУММА(ТаблицаВидыЗапасов.СуммаВзаиморасчетов),
//	|	СУММА(ТаблицаВидыЗапасов.СуммаВзаиморасчетов - ТаблицаВидыЗапасов.СуммаНДСВзаиморасчетов),
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаВидыЗапасов.ВидЗапасов
//	|		ИНАЧЕ КлючиАналитикиУчетаНоменклатуры.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаВидыЗапасов.ОбъектРасчетов
//	|ИЗ
//	|	ВтВидыЗапасов КАК ТаблицаВидыЗапасов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
//	|		ПО ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
//	|ГДЕ
//	|	ТаблицаВидыЗапасов.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
//	|	И НЕ ТаблицаВидыЗапасов.СписатьНаРасходы
//	|	И &ИспользуетсяДокументПоступлениеТоваров
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВЫБОР
//	|		КОГДА &ХозяйственнаяОперация В (
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки),
//	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки))
//	|		ИЛИ &УчитыватьСебестоимостьТоваровПоНазначениям
//	|			ТОГДА ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
//	|		ИНАЧЕ
//	|			ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыБезНазначения
//	|	КОНЕЦ,
//	|	ТаблицаВидыЗапасов.НаправлениеДеятельности,
//	|	ТаблицаВидыЗапасов.Склад,
//	|	ТаблицаВидыЗапасов.ВидЗапасов.ТипЗапасов,
//	|	ТаблицаВидыЗапасов.ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаВидыЗапасов.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам
//	|				И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаВидыЗапасов.ВидЗапасов
//	|		ИНАЧЕ КлючиАналитикиУчетаНоменклатуры.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаВидыЗапасов.ОбъектРасчетов,
//	|	ВЫБОР КОГДА ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыНазначениеТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала)
//	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемкаПодПринципала)
//	|		ИНАЧЕ &ХозяйственнаяОперация
//	|	КОНЕЦ,
//	|	ТаблицаВидыЗапасов.ВидДеятельностиНДС";
//
//	МассивЗапросов.Добавить(ПоступлениеТоваров);
//
//	КонецЕсли;
//
//#КонецОбласти
//
//
//#Область ПоступлениеРабот
//
//	Если ДокументОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо Тогда
//
//	ПоступлениеРабот =
//	"ВЫБРАТЬ
//	|	&Период КАК Период,
//	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	&Организация КАК Организация,
//	|	ТаблицаТовары.Подразделение КАК Подразделение,
//	|	&Менеджер КАК Менеджер,
//	|
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельностиНоменклатуры,
//	|	&Подразделение КАК Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов КАК ТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов КАК ВидЗапасов,
//	|
//	|	&Партнер КАК Партнер,
//	|	&Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА &УчетРасчетовСПоставщикамиПоНД ТОГДА
//	|			&НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
//	|	&Соглашение КАК Соглашение,
//	|	&Договор КАК Договор,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаТовары.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ КАК Заказ,
//	|	НЕОПРЕДЕЛЕНО КАК ПодотчетноеЛицо,
//	|
//	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Сумма,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СуммаБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл) КАК СуммаРегл,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл) КАК СуммаРеглБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаСкидки) КАК СуммаСкидки,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Стоимость,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.ВидДеятельностиНДС В (
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
//	|			ТОГДА СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл)
//	|		ИНАЧЕ СУММА(ТаблицаТовары.СуммаБезНДСРегл)
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	0 КАК ДопРасходы,
//	|	0 КАК ДопРасходыБезНДС,
//	|
//	|	&Валюта КАК ВалютаДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС) КАК СуммаВВалютеДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) КАК СуммаБезНДСВВалютеДокумента,
//	|
//	|	&ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов) КАК СуммаВВалютеВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов - ТаблицаТовары.СуммаНДСВзаиморасчетов) КАК СуммаБезНДСВВалютеВзаиморасчетов,
//	|
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
//	|	ТаблицаТовары.ОбъектРасчетов КАК ИсточникГФУРасчетов
//	|ИЗ
//	|	ВтТаблицаТовары КАК ТаблицаТовары
//	|ГДЕ
//	|	ТаблицаТовары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
//	|	И НЕ ТаблицаТовары.СписатьНаРасходы
//	|	И НЕ &ИспользуетсяДокументПоступлениеТоваров
//	|	И (ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//	|		ИЛИ НЕ ТаблицаТовары.НазначениеТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаТовары.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаТовары.ОбъектРасчетов,
//	|	ТаблицаТовары.Подразделение,
//	|	ТаблицаТовары.ВидДеятельностиНДС
//	|";
//
//	МассивЗапросов.Добавить(ПоступлениеРабот);
//
//	КонецЕсли;
//
//#КонецОбласти
//
//#Область ПриемНаКомиссию
//
//	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию Тогда
//
//	ПриемНаКомиссию =
//	"ВЫБРАТЬ
//	|	&Период КАК Период,
//	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	&Организация КАК Организация,
//	|	&Подразделение КАК Подразделение,
//	|	&Менеджер КАК Менеджер,
//	|
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельностиНоменклатуры,
//	|	ТаблицаТовары.Склад КАК Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов КАК ТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов КАК ВидЗапасов,
//	|
//	|	&Партнер КАК Партнер,
//	|	&Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА &УчетРасчетовСПоставщикамиПоНД ТОГДА
//	|			&НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
//	|	&Соглашение КАК Соглашение,
//	|	&Договор КАК Договор,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаТовары.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ КАК Заказ,
//	|	НЕОПРЕДЕЛЕНО КАК ПодотчетноеЛицо,
//	|
//	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
//	|
//	|	0 КАК Сумма,
//	|	0 КАК СуммаБезНДС,
//	|	0 КАК СуммаРегл,
//	|	0 КАК СуммаРеглБезНДС,
//	|	0 КАК СуммаСкидки,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Стоимость,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.ВидДеятельностиНДС В (
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
//	|			ТОГДА СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл)
//	|		ИНАЧЕ СУММА(ТаблицаТовары.СуммаБезНДСРегл)
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	0 КАК ДопРасходы,
//	|	0 КАК ДопРасходыБезНДС,
//	|
//	|	&Валюта КАК ВалютаДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС) КАК СуммаВВалютеДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) КАК СуммаБезНДСВВалютеДокумента,
//	|
//	|	&ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов) КАК СуммаВВалютеВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов - ТаблицаТовары.СуммаНДСВзаиморасчетов) КАК СуммаБезНДСВВалютеВзаиморасчетов,
//	|
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
//	|	ТаблицаТовары.ОбъектРасчетов КАК ИсточникГФУРасчетов
//	|ИЗ
//	|	ВтТаблицаТовары КАК ТаблицаТовары
//	|ГДЕ
//	|	ТаблицаТовары.ТипНоменклатуры В (
//	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
//	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
//	|	И НЕ ТаблицаТовары.СписатьНаРасходы
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности,
//	|	ТаблицаТовары.Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА &ПоступлениеПоЗаказам И &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА ТаблицаТовары.ЗаказПоставщику
//	|		КОГДА &ПоступлениеПоЗаказам И НЕ &ПоступлениеПоНесколькимЗаказам
//	|			ТОГДА &ЗаказПоставщику
//	|		ИНАЧЕ &Ссылка
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаТовары.ОбъектРасчетов,
//	|	ТаблицаТовары.ВидДеятельностиНДС
//	|";
//
//	МассивЗапросов.Добавить(ПриемНаКомиссию);
//
//	КонецЕсли;
//
//#КонецОбласти
//
//#Область ПоступлениеТоваровЧерезПодотчетника
//
//	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо Тогда
//
//	ПоступлениеТоваровЧерезПодотчетника =
//	"ВЫБРАТЬ
//	|	&Период КАК Период,
//	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	&Организация КАК Организация,
//	|	&Подразделение КАК Подразделение,
//	|	&Менеджер КАК Менеджер,
//	|
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельностиНоменклатуры,
//	|	ТаблицаТовары.Склад КАК Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов КАК ТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов КАК ВидЗапасов,
//	|
//	|	&Партнер КАК Партнер,
//	|	ВЫБОР
//	|		КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	|				ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
//	|			НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ
//	|			&Контрагент
//	|	КОНЕЦ КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА &УчетРасчетовСПоставщикамиПоНД ТОГДА
//	|			&НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
//	|	&Соглашение КАК Соглашение,
//	|	ВЫБОР
//	|		КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|				ИЛИ &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыМеждуОрганизациями.ПустаяСсылка) ТОГДА
//	|			НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ
//	|			&Договор
//	|	КОНЕЦ КАК Договор,
//	|	&Ссылка КАК Заказ,
//	|	&ПодотчетноеЛицо КАК ПодотчетноеЛицо,
//	|
//	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Сумма,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СуммаБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл) КАК СуммаРегл,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл) КАК СуммаРеглБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаСкидки) КАК СуммаСкидки,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Стоимость,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.ВидДеятельностиНДС В (
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
//	|			ТОГДА СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл)
//	|		ИНАЧЕ СУММА(ТаблицаТовары.СуммаБезНДСРегл)
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	0 КАК ДопРасходы,
//	|	0 КАК ДопРасходыБезНДС,
//	|
//	|	&Валюта КАК ВалютаДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС) КАК СуммаВВалютеДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) КАК СуммаБезНДСВВалютеДокумента,
//	|
//	|	&ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов) КАК СуммаВВалютеВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов - ТаблицаТовары.СуммаНДСВзаиморасчетов) КАК СуммаБезНДСВВалютеВзаиморасчетов,
//	|
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
//	|	ТаблицаТовары.ОбъектРасчетов КАК ИсточникГФУРасчетов
//	|ИЗ
//	|	ВтТаблицаТовары КАК ТаблицаТовары
//	|ГДЕ
//	|	ТаблицаТовары.ТипНоменклатуры В (
//	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
//	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
//	|	И НЕ ТаблицаТовары.СписатьНаРасходы
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности,
//	|	ТаблицаТовары.Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаТовары.ОбъектРасчетов,
//	|	ТаблицаТовары.ВидДеятельностиНДС
//	|";
//
//	МассивЗапросов.Добавить(ПоступлениеТоваровЧерезПодотчетника);
//
//	КонецЕсли;
//
//#КонецОбласти
//
//#Область ПоступлениеРаботЧерезПодотчетника
//
//	Если ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо Тогда
//
//	ПоступлениеРаботЧерезПодотчетника =
//	"ВЫБРАТЬ
//	|	&Период КАК Период,
//	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	&Организация КАК Организация,
//	|	ТаблицаТовары.Подразделение КАК Подразделение,
//	|	&Менеджер КАК Менеджер,
//	|
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности КАК НаправлениеДеятельностиНоменклатуры,
//	|	&Подразделение КАК Склад,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов КАК ТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов КАК ВидЗапасов,
//	|
//	|	&Партнер КАК Партнер,
//	|	&Контрагент КАК Контрагент,
//	|	ВЫБОР
//	|		КОГДА &УчетРасчетовСПоставщикамиПоНД ТОГДА
//	|			&НаправлениеДеятельности
//	|	КОНЕЦ КАК НаправлениеДеятельностиКонтрагента,
//	|	&Соглашение КАК Соглашение,
//	|	&Договор КАК Договор,
//	|	&Ссылка КАК Заказ,
//	|	&ПодотчетноеЛицо КАК ПодотчетноеЛицо,
//	|
//	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Сумма,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СуммаБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл) КАК СуммаРегл,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСРегл) КАК СуммаРеглБезНДС,
//	|	СУММА(ТаблицаТовары.СуммаСкидки) КАК СуммаСкидки,
//	|
//	|	СУММА(ТаблицаТовары.СуммаСНДСУпр) КАК Стоимость,
//	|	СУММА(ТаблицаТовары.СуммаБезНДСУпр) КАК СтоимостьБезНДС,
//	|	ВЫБОР
//	|		КОГДА ТаблицаТовары.ВидДеятельностиНДС В (
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
//	|				ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
//	|			ТОГДА СУММА(ТаблицаТовары.СуммаБезНДСРегл + ТаблицаТовары.СуммаНДСРегл)
//	|		ИНАЧЕ СУММА(ТаблицаТовары.СуммаБезНДСРегл)
//	|	КОНЕЦ КАК СтоимостьРегл,
//	|	0 КАК ДопРасходы,
//	|	0 КАК ДопРасходыБезНДС,
//	|
//	|	&Валюта КАК ВалютаДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС) КАК СуммаВВалютеДокумента,
//	|	СУММА(ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) КАК СуммаБезНДСВВалютеДокумента,
//	|
//	|	&ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов) КАК СуммаВВалютеВзаиморасчетов,
//	|	СУММА(ТаблицаТовары.СуммаВзаиморасчетов - ТаблицаТовары.СуммаНДСВзаиморасчетов) КАК СуммаБезНДСВВалютеВзаиморасчетов,
//	|
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ КАК ИсточникГФУНоменклатуры,
//	|	ТаблицаТовары.ОбъектРасчетов КАК ИсточникГФУРасчетов
//	|ИЗ
//	|	ВтТаблицаТовары КАК ТаблицаТовары
//	|ГДЕ
//	|	ТаблицаТовары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
//	|	И НЕ ТаблицаТовары.СписатьНаРасходы
//	|   И (ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
//	|		ИЛИ НЕ ТаблицаТовары.НазначениеТипНазначения = ЗНАЧЕНИЕ(Перечисление.ТипыНазначений.ПоставкаПодПринципала))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТовары.АналитикаУчетаНоменклатуры,
//	|	ТаблицаТовары.НаправлениеДеятельности,
//	|	ТаблицаТовары.ВидЗапасовТипЗапасов,
//	|	ТаблицаТовары.ВидЗапасов,
//	|	ВЫБОР
//	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
//	|			ТОГДА ТаблицаТовары.ВидЗапасов
//	|		ИНАЧЕ ТаблицаТовары.Номенклатура
//	|	КОНЕЦ,
//	|	ТаблицаТовары.Подразделение,
//	|	ТаблицаТовары.ОбъектРасчетов,
//	|	ТаблицаТовары.ВидДеятельностиНДС
//	|";
//
//	МассивЗапросов.Добавить(ПоступлениеРаботЧерезПодотчетника);
//
//	КонецЕсли;
//
//#КонецОбласти
//
//	//@skip-check undefined-variable
//	Если МассивЗапросов.Количество() = 0 Тогда
//		//@skip-check bsl-legacy-check-return-statement
//		Возврат "";
//	КонецЕсли;
//
//	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
//		ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса, ДокументОбъект);
//	КонецЕсли;
//
//	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтВидыЗапасов", ТекстыЗапроса) Тогда
//		ТекстЗапросаВтВидыЗапасов(Запрос, ТекстыЗапроса, ДокументОбъект);
//	КонецЕсли;
//
//	ТекстЗапроса = СтрСоединить(МассивЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
//
//	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
//	Возврат ТекстЗапроса;
//
//КонецФункции
//
//#КонецОбласти
//#КонецОбласти
//
//#КонецЕсли