#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	RA_AdditionalFields_ДобавитьЭлементыНаФорму();	

КонецПроцедуры

&НаКлиенте
Процедура RA_AdditionalFieldsОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("АдресВХранилищеПроизводители") Тогда
		RA_AdditionalFields_ПолучитьПроизводителейИзХранилища(ВыбранноеЗначение.АдресВХранилищеПроизводители);
		RA_AdditionalFields_ОбновитьПредставлениеГиперссылкиДополнительныхПроизводителей();
		Модифицированность = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_ОбновитьПредставлениеГиперссылкиДополнительныхПроизводителей()

	//@skip-check bsl-legacy-check-expression-type
	Элементы.RA_Гиперссылка_ДополнительныеПроизводители.Заголовок = "Дополнительные производители" + ?(Объект.RA_AdditionalFields_ДополнительныеПроизводители.Количество(),
	СтрШаблон(" (%1)", Объект.RA_AdditionalFields_ДополнительныеПроизводители.Количество()),"");
	
КонецПроцедуры	

&НаСервере
Процедура RA_AdditionalFields_ПолучитьПроизводителейИзХранилища(АдресВХранилище)
	
	ТаблицаПроизводителей = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Объект.RA_AdditionalFields_ДополнительныеПроизводители.Загрузить(ТаблицаПроизводителей);
		
КонецПроцедуры	

&НаСервере
Процедура RA_AdditionalFields_ДобавитьЭлементыНаФорму()
	
	//Добавим группу Bayer
	ГруппаBayer = Элементы.Добавить("РА_ГруппаBayer", Тип("ГруппаФормы"), Элементы.ГруппаШапка);
	ГруппаBayer.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//@skip-check wrong-type-expression
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаBayer.ОтображатьЗаголовок = Истина;
	ГруппаBayer.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаBayer.Заголовок = "Bayer";
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаBayer.Поведение = ПоведениеОбычнойГруппы.Свертываемая; 
	ГруппаBayer.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ГруппаBayer.Скрыть();

	НовыйЭлемент = Элементы.Добавить("RA_ДополнительноеНаименование", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ДополнительноеНаименование";

	НовыйЭлемент = Элементы.Добавить("RA_КодSAP", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_КодSAP";

	НовыйЭлемент = Элементы.Добавить("RA_ProfitCentre", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ProfitCentre";
	
	НовыйЭлемент = Элементы.Добавить("RA_Division", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ProfitCentre.RA_AdditionalFields_Division";
	
	НовыйЭлемент = Элементы.Добавить("RA_PurchasingOrganization", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_PurchasingOrganization";
	
	НовыйЭлемент = Элементы.Добавить("RA_PurchasingGroup", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_PurchasingGroup";
	
	НовыйЭлемент = Элементы.Добавить("RA_DChainSpecStatus", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_DChainSpecStatus";
	
	НовыйЭлемент = Элементы.Добавить("RA_ValidFrom", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ValidFrom";
	
	НовыйЭлемент = Элементы.Добавить("RA_XPlantMatlStatus", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_XPlantMatlStatus";
	
	НовыйЭлемент = Элементы.Добавить("RA_XPlntMatlValidFrom", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_XPlntMatlValidFrom";
	
	НовыйЭлемент = Элементы.Добавить("RA_MaterialType", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_MaterialType";
	
	НовыйЭлемент = Элементы.Добавить("RA_MaterialGroup", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_MaterialGroup";
	
	НовыйЭлемент = Элементы.Добавить("RA_Гиперссылка_ДополнительныеПроизводители", Тип("ДекорацияФормы"), ГруппаBayer);
	//@skip-check bsl-legacy-check-expression-type
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Заголовок = "Дополнительные производители";
	НовыйЭлемент.УстановитьДействие("Нажатие", "RA_AdditionalFields_Подключаемый_ДополнительныеПРоизводителиНажатие");
	
	RA_AdditionalFields_ОбновитьПредставлениеГиперссылкиДополнительныхПроизводителей();
	
	НовыйЭлемент = Элементы.Добавить("RA_ЖНВЛП", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_ЖНВЛП";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "RA_AdditionalFields_Подключаемый_ЖНВЛП_ПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("RA_БАД", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_БАД";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "RA_AdditionalFields_Подключаемый_БАД_ПриИзменении");
		
	НовыйЭлемент = Элементы.Добавить("RA_МННЛП", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_МННЛП";
		
КонецПроцедуры

&НаКлиенте
Процедура RA_AdditionalFields_Подключаемый_ДополнительныеПРоизводителиНажатие(Элемент)
	
	АдресВХранилище = RA_AdditionalFields_ПолучитьАдресВРеменногоХранилищаТаблицыПроизводителей();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресВХранилище", АдресВХранилище);

	ОткрытьФорму("Справочник.Номенклатура.Форма.RA_AdditionalFields_ДополнительныеПроизводители", СтруктураПараметров, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура RA_AdditionalFields_Подключаемый_БАД_ПриИзменении(Элемент)

	Если Объект.RA_AdditionalFields_БАД Тогда
		Объект.RA_AdditionalFields_ЖНВЛП = Ложь;
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура RA_AdditionalFields_Подключаемый_ЖНВЛП_ПриИзменении(Элемент)
	
	Если Объект.RA_AdditionalFields_ЖНВЛП Тогда
		Объект.RA_AdditionalFields_БАД = Ложь;
	КонецЕсли;	
			
КонецПроцедуры

&НаСервере 
Функция RA_AdditionalFields_ПолучитьАдресВРеменногоХранилищаТаблицыПроизводителей()

	СпрОбъект = РеквизитФормыВЗначение("Объект");
	
	ТаблицаПроизводителей = СпрОбъект.RA_AdditionalFields_ДополнительныеПроизводители.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПроизводителей);

КонецФункции	

#КонецОбласти