
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_DivisionsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	//Добавим группу Bayer
	ГруппаBayer = Элементы.Вставить("ГруппаОбычная", Тип("ГруппаФормы"), ЭтотОбъект, Элементы.Группа1);
	ГруппаBayer.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//@skip-check wrong-type-expression
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаBayer.ОтображатьЗаголовок = Истина; 
	ГруппаBayer.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаBayer.Заголовок = "BAYER";
	
	НовыйЭлемент = Элементы.Добавить("RA_Division", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_Divisions_Division";

КонецПроцедуры

#КонецОбласти