#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	RA_AdditionalFields_МодифицироватьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_МодифицироватьФорму()

	//Добавим группу Bayer
	ГруппаBayer = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаBayer.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//@skip-check wrong-type-expression
	//@skip-check bsl-legacy-check-expression-type
	ГруппаBayer.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаBayer.ОтображатьЗаголовок = Истина;
	ГруппаBayer.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаBayer.Заголовок = "BAYER";
	
	//@skip-check bsl-legacy-check-expression-type
	ПараметрыВыбораЭлемента = Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.RA_AdditionalFields_ItsCostCentre", Истина)));

	НовыйЭлемент = Элементы.Добавить("RA_CostCentre", Тип("ПолеФормы"), ГруппаBayer);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.RA_AdditionalFields_CostCentre";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПараметрыВыбора = ПараметрыВыбораЭлемента;

КонецПроцедуры

#КонецОбласти