#Область ПрограммныйИнтерфейс

// R a additional fields при создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&После("ПриСозданииНаСервере")
Процедура RA_AdditionalFields_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда
		
	// Настроим параметры выбора и предсставлене поля "Менеджер"
		RA_AdditionalFields_ИзменениеИнтерфейсаФорм.НастроитьПолеМенеджерНаФормеДокумента(Форма);

	ИначеЕсли Форма.ИмяФормы = "Документ.КорректировкаПриобретения.Форма.ФормаДокумента" Тогда
		
	// Настроим параметры выбора и предсставлене поля "Менеджер"
		RA_AdditionalFields_ИзменениеИнтерфейсаФорм.НастроитьПолеМенеджерНаФормеДокумента(Форма, Истина);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
