#Область ОбработчикиСобытийФормы

&НаСервере
Процедура RA_AdditionalFieldsПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	RA_AdditionalFields_МодификацияФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура RA_AdditionalFields_МодификацияФормы()
	
	// Настроим параметры выбора и предсставлене поля "Менеджер"
	RA_AdditionalFields_ИзменениеИнтерфейсаФорм.НастроитьПолеМенеджерНаФормеДокумента(ЭтотОбъект, Истина);

КонецПроцедуры

#КонецОбласти